import s from './AboutMe.module.scss';

export const AboutMe = () => {
  return (
    <div className={s.about}>
      <div className={s.about__title}>
        <h1>Про мене</h1>
      </div>
      <h2>
        Моя ціль — не просто писати код, а будувати продукти, якими зручно користуватися, які швидко працюють і виглядають естетично.
      </h2>

      <ul>
        <li>Мої скіли:</li>
        <li>Мови: JavaScript, TypeScript, HTML5, CSS3, SCSS</li>
        <li>Фреймворки / Бібліотеки: React, Redux, React Router, TailwindCSS</li>
        <li>Інші технології: Webpack, Git, GitHub, REST API, i18next</li>
        <li>Інструменти: VS Code, Figma, Postman, Chrome DevTools</li>
      </ul>

      <ul>
        <li>Підхід до роботи:</li>
        <li>Пишу чистий і структурований код, використовуючи компонентну архітектуру.</li>
        <li>Впроваджую адаптивну верстку, з урахуванням кросбраузерності.</li>
        <li>Застосовую принципи UI/UX для зручності користувачів.</li>
        <li>Працюю з інтернаціоналізацією (i18n), а також темами з використанням CSS-змінних і SCSS.</li>
      </ul>

      <ul>
        <li>Чим я пишаюсь:</li>
        <li>Створив повністю адаптивний інтернет-магазин з мультимовною підтримкою та анімаціями.</li>
        <li>Розробив гру “2048” з використанням нативного JavaScript та логікою обробки комбінацій.</li>
        <li>Побудував власне портфоліо з кастомним дизайном, темною темою та flip-анімаціями між розділами.</li>
      </ul>

      <ul>
        <li>Цілі на майбутнє:</li>
        <li>Поглибити знання у сфері React Native та Next.js</li>
        <li>Освоїти тестування (Jest / Cypress)</li>
        <li>Взяти участь у відкритих проєктах або волонтерській розробці</li>
      </ul>
    </div>
  );
};
